Revit 2027 API
ExportLinetypeTable.GetEnumerator Method
Returns an enumerator that iterates through a collection.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual IEnumerator<KeyValuePair<ExportLinetypeKey, ExportLinetypeInfo>> GetEnumerator()
Public Overridable Function GetEnumerator As IEnumerator(Of KeyValuePair(Of ExportLinetypeKey, ExportLinetypeInfo))
public:
virtual IEnumerator<KeyValuePair<ExportLinetypeKey^, ExportLinetypeInfo^>>^ GetEnumerator()
abstract GetEnumerator : unit -> IEnumerator<KeyValuePair<ExportLinetypeKey, ExportLinetypeInfo>>
override GetEnumerator : unit -> IEnumerator<KeyValuePair<ExportLinetypeKey, ExportLinetypeInfo>>
Return Value
IEnumerator<KeyValuePair<ExportLinetypeKey, ExportLinetypeInfo>>
An IEnumerator object that can be used to iterate through the collection.
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
ExportLinetypeTable Class
Autodesk.Revit.DB Namespace